case/elect_cooling2/system/controlDict
FoamFile
{
	class	dictionary;
	format	ascii;
	location	system;
	object	controlDict;
	version	2.0;
}
application	chtMultiRegionSimpleFoam;
deltaT	1;
endTime	2000;
purgeWrite	2;
startFrom	latestTime;
startTime	0;
stopAt	endTime;
timeFormat	general;
timePrecision	6;
writeControl	timeStep;
writeInterval	10;
writePrecision	7;
runTimeModifiable	true;
timeFormat	general;
timePrecision	6;
writeCompression	false;
writeFormat	binary;
writePrecision	7;
libs	("libfvMotionSolvers.dll" "libturbulenceModels.dll" "libturbulenceModelSchemes.dll" "libfvOptions.dll");
functions
{
	writeExtraFieldsInFluid
	{
		libs	("libutilityFunctionObjects.dll");
		objects	(rho);
		type	writeObjects;
		writeOption	anyWrite;
		executeInterval	1;
		enabled	true;
		log	true;
		writeControl	writeTime;
		writeInterval	1;
		region	fluid;
	}
}
OptimisationSwitches
{
	fileHandler	uncollated;
	fileModificationSkew	0;
	maxMasterFileBufferSize	1.0E9;
	maxThreadFileBufferSize	1.0E9;
	mpiBufferSize	200000000;
}
