case/elect_cooling2/constant/fluid/MRFProperties
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"constant/fluid";
	object	MRFProperties;
}
