case/elect_cooling2/constant/fluid/radiationProperties
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant/fluid";
	object	radiationProperties;
}
radiation	true;
solverFreq	5;
radiationModel	viewFactor;
viewFactorCoeffs
{
	constantEmissivity	true;
	smoothing	true;
	useSolarLoad	false;
}
absorptionEmissionModel	none;
scatterModel	none;
transmissivityModel	none;
useSolarLoad	false;
solarLoadCoeffs
{
	sunDirectionModel	sunDirConstant;
	sunDirection	(0 0 -1);
	sunLoadModel	sunLoadConstant;
	directSolarRad	1000.0;
	diffuseSolarRad	0.0;
	C	0.0;
	useVFbeamToDiffuse	false;
	spectralDistribution	(1);
	wallCoupled	true;
	solidCoupled	false;
	useReflectedRays	true;
	reflecting
	{
	}
}
solarLoarCoeffs
{
	sunDirectionModel	sunDirConstant;
	sunDirection	(0 0 -1);
	sunLoadModel	sunLoadConstant;
	directSolarRad	1000.0;
	diffuseSolarRad	0.0;
	C	0.0;
	useVFbeamToDiffuse	false;
	spectralDistribution	(1);
	wallCoupled	true;
	solidCoupled	false;
	useReflectedRays	true;
	reflecting
	{
	}
}
