case/elect_cooling2/0/fluid/p
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0/fluid";
	object	p;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[1 -1 -2 0 0 0 0];
internalField	uniform 100000;
boundaryField
{
	boundaries
	{
		type	calculated;
		value	uniform 100000;
	}
	board
	{
		type	calculated;
		value	uniform 100000;
	}
	cpu
	{
		type	calculated;
		value	uniform 100000;
	}
	fan
	{
		type	calculated;
		value	uniform 100000;
	}
	fan_inlet
	{
		type	calculated;
		value	uniform 100000;
	}
	outlet
	{
		type	calculated;
		value	uniform 100000;
	}
}
