case/elect_cooling2/0/fluid/boundaryRadiationProperties
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0/fluid";
	object	boundaryRadiationProperties;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 0 0 0 0 0 0];
internalField	uniform 0.0;
boundaryField
{
	boundaries
	{
		type	boundaryRadiation;
		value	uniform 0.0;
		mode	lookup;
		emissivity	1.0;
		absorptivity	1.0;
		transmissivity	0.0;
	}
	board
	{
		type	boundaryRadiation;
		value	uniform 0.0;
		mode	lookup;
		emissivity	1.0;
		absorptivity	1.0;
		transmissivity	0.0;
	}
	cpu
	{
		type	boundaryRadiation;
		value	uniform 0.0;
		mode	lookup;
		emissivity	1.0;
		absorptivity	1.0;
		transmissivity	0.0;
	}
	fan
	{
		type	boundaryRadiation;
		value	uniform 0.0;
		mode	lookup;
		emissivity	1.0;
		absorptivity	1.0;
		transmissivity	0.0;
	}
	fan_inlet
	{
		type	boundaryRadiation;
		value	uniform 0.0;
		mode	lookup;
		emissivity	1.0;
		absorptivity	1.0;
		transmissivity	0.0;
	}
	outlet
	{
		type	boundaryRadiation;
		value	uniform 0.0;
		mode	lookup;
		emissivity	1.0;
		absorptivity	1.0;
		transmissivity	0.0;
	}
}
