case/elect_cooling2/system/fluid/changeDictionaryDict
FoamFile
{
	version	2.0;
	format	binary;
	class	dictionary;
	location	"system/fluid";
	object	changeDictionaryDict;
}
p_rgh
{
	boundaryField
	{
		boundaries
		{
			type	fixedFluxPressure;
		}
		board
		{
			type	fixedFluxPressure;
		}
		cpu
		{
			type	fixedFluxPressure;
		}
		fan
		{
			type	fixedFluxPressure;
		}
		fan_inlet
		{
			type	fixedFluxPressure;
		}
		outlet
		{
			type	fixedValue;
			value	uniform 100000;
		}
	}
}
p
{
	boundaryField
	{
	}
}
U
{
	boundaryField
	{
		boundaries
		{
			type	noSlip;
		}
		board
		{
			type	noSlip;
		}
		cpu
		{
			type	noSlip;
		}
		fan
		{
			type	noSlip;
		}
		fan_inlet
		{
			type	surfaceNormalFixedValue;
			refValue	uniform -0.1;
		}
		outlet
		{
			type	pressureInletOutletVelocity;
		}
	}
}
T
{
	boundaryField
	{
		boundaries
		{
			type	zeroGradient;
		}
		board
		{
			type	zeroGradient;
		}
		cpu
		{
			type	compressible::turbulentTemperatureRadCoupledMixed;
			qrNbr	none;
			qr	qr;
			neighbourFieldName	T;
			alphaAni	Anialpha;
			kappaMethod	fluidThermo;
			kappa	none;
			Tnbr	T;
			thicknessLayers	();
			kappaLayers	();
		}
		fan
		{
			type	zeroGradient;
		}
		fan_inlet
		{
			type	totalTemperature;
			T0	uniform 300;
			gamma	1.396;
		}
		outlet
		{
			type	inletOutlet;
			inletValue	uniform 300;
		}
	}
}
k
{
	boundaryField
	{
		boundaries
		{
			type	kqRWallFunction;
		}
		board
		{
			type	kqRWallFunction;
		}
		cpu
		{
			type	kqRWallFunction;
		}
		fan
		{
			type	kqRWallFunction;
		}
		fan_inlet
		{
			type	turbulentIntensityKineticEnergyInlet;
			intensity	0.05;
		}
		outlet
		{
			type	zeroGradient;
		}
	}
}
epsilon
{
	boundaryField
	{
		boundaries
		{
			type	epsilonWallFunction;
		}
		board
		{
			type	epsilonWallFunction;
		}
		cpu
		{
			type	epsilonWallFunction;
		}
		fan
		{
			type	epsilonWallFunction;
		}
		fan_inlet
		{
			type	turbulentMixingLengthDissipationRateInlet;
			mixingLength	0.001;
		}
		outlet
		{
			type	zeroGradient;
		}
	}
}
nut
{
	boundaryField
	{
		boundaries
		{
			type	nutUWallFunction;
		}
		board
		{
			type	nutUWallFunction;
		}
		cpu
		{
			type	nutUWallFunction;
		}
		fan
		{
			type	nutUWallFunction;
		}
	}
}
alphat
{
	boundaryField
	{
		boundaries
		{
			type	compressible::alphatJayatillekeWallFunction;
			Prt	0.85;
		}
		board
		{
			type	compressible::alphatJayatillekeWallFunction;
			Prt	0.85;
		}
		cpu
		{
			type	compressible::alphatJayatillekeWallFunction;
			Prt	0.85;
		}
		fan
		{
			type	compressible::alphatJayatillekeWallFunction;
			Prt	0.85;
		}
	}
}
qr
{
	boundaryField
	{
		boundaries
		{
			type	greyDiffusiveRadiationViewFactor;
			qro	uniform 0;
			T	T;
		}
		board
		{
			type	greyDiffusiveRadiationViewFactor;
			qro	uniform 0;
			T	T;
		}
		cpu
		{
			type	greyDiffusiveRadiationViewFactor;
			qro	uniform 0;
			T	T;
		}
		fan
		{
			type	greyDiffusiveRadiationViewFactor;
			qro	uniform 0;
			T	T;
		}
	}
}
boundaryRadiationProperties
{
	boundaryField
	{
		boundaries
		{
			type	boundaryRadiation;
			mode	lookup;
			emissivity	1.0;
			absorptivity	1.0;
			transmissivity	0.0;
		}
		board
		{
			type	boundaryRadiation;
			mode	lookup;
			emissivity	1.0;
			absorptivity	1.0;
			transmissivity	0.0;
		}
		cpu
		{
			type	boundaryRadiation;
			mode	lookup;
			emissivity	1.0;
			absorptivity	1.0;
			transmissivity	0.0;
		}
		fan
		{
			type	boundaryRadiation;
			mode	lookup;
			emissivity	1.0;
			absorptivity	1.0;
			transmissivity	0.0;
		}
		fan_inlet
		{
			type	boundaryRadiation;
			mode	lookup;
			emissivity	1.0;
			absorptivity	1.0;
			transmissivity	0.0;
		}
		outlet
		{
			type	boundaryRadiation;
			mode	lookup;
			emissivity	1.0;
			absorptivity	1.0;
			transmissivity	0.0;
		}
	}
}
