case/elect_cooling2/system/fluid/fvOptions
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system/fluid";
	object	fvOptions;
}
temperatureLimit
{
	active	true;
	type	limitTemperature;
	limitTemperatureCoeffs
	{
		min	290;
		max	600;
		selectionMode	all;
	}
}
